{
  "action_horizon": 50,
  "add_pos_embed": true,
  "apply_sincos_state_encoding": true,
  "architectures": [
    "Gr00tN1d6"
  ],
  "attn_dropout": 0.2,
  "attn_implementation": null,
  "backbone_embedding_dim": 2048,
  "backbone_model_type": "eagle",
  "backbone_trainable_params_fp32": true,
  "collator_overwrite_image_inputs": false,
  "color_jitter_params": {
    "brightness": 0.1,
    "contrast": 0.1,
    "hue": 0.1,
    "saturation": 0.1
  },
  "crop_fraction": 0.95,
  "diffusion_model_cfg": {
    "attention_head_dim": 48,
    "dropout": 0.2,
    "final_dropout": true,
    "interleave_self_attention": true,
    "norm_type": "ada_norm",
    "num_attention_heads": 32,
    "num_layers": 32,
    "output_dim": 1024,
    "positional_embeddings": null
  },
  "eagle_collator": true,
  "formalize_language": true,
  "gemma_collator": false,
  "hidden_size": 1024,
  "image_crop_size": null,
  "image_target_size": null,
  "input_embedding_dim": 1536,
  "load_bf16": true,
  "max_action_dim": 128,
  "max_num_embodiments": 32,
  "max_seq_len": 1024,
  "max_state_dim": 128,
  "model_dtype": "bfloat16",
  "model_name": "nvidia/Eagle-Block2A-2B-v2",
  "model_type": "Gr00tN1d6",
  "noise_beta_alpha": 1.5,
  "noise_beta_beta": 1.0,
  "noise_s": 0.999,
  "num_inference_timesteps": 4,
  "num_timestep_buckets": 1000,
  "random_rotation_angle": null,
  "reproject_vision": false,
  "select_layer": 16,
  "shortest_image_edge": 256,
  "state_dropout_prob": 0.0,
  "torch_dtype": "bfloat16",
  "transformers_version": "4.51.3",
  "tune_diffusion_model": true,
  "tune_llm": false,
  "tune_projector": true,
  "tune_top_llm_layers": 4,
  "tune_visual": false,
  "tune_vlln": true,
  "use_albumentations_transforms": true,
  "use_alternate_vl_dit": true,
  "use_flash_attention": true,
  "use_relative_action": true,
  "use_vlln": true
}
